Repository: drunsinn/pyLSV2
Catalog: pyLSV2/locales/*/LC_MESSAGES/error_text.po
Languages: de

# LSV2_ERROR_T_ER_BAD_FORMAT
source: format error in telegram
de: Formatfehler im Telegramm

# LSV2_ERROR_T_ER_UNEXPECTED_TELE
source: telegram not supported by protocol
de: gesendetes Telegram passt nicht zum Protokoll

# LSV2_ERROR_T_ER_UNKNOWN_TELE
source: unknown telegram type
de: Telegrammtyp nicht bekannt

# LSV2_ERROR_T_ER_NO_PRIV
source: no privilege for execution
de: Kein Privileg für Ausführung

# LSV2_ERROR_T_ER_WRONG_PARA
source: wrong parameter
de: Parameter nicht zulässig

# LSV2_ERROR_T_ER_BREAK
source: stopped by user
de: Vom Benutzer abgebrochen

# LSV2_ERROR_T_ER_BAD_KEY
source: bad key number for login
de: falsche Schlüsselzahl für Login

# LSV2_ERROR_T_ER_BAD_FNAME
source: bad file or path name
de: Dateiname / Pfadname nicht zulässig

# LSV2_ERROR_T_ER_NO_FILE
source: file does not exist
de: Datei existiert nicht

# LSV2_ERROR_T_ER_OPEN_FILE
source: could not open file
de: Datei kann nicht geöffnet werden

# LSV2_ERROR_T_ER_FILE_EXISTS
source: file already exists
de: Datei existiert bereits

# LSV2_ERROR_T_ER_BAD_FILE
source: file type unknown or not allowed
de: Dateityp darf nicht geladen werden (z.B. Programmname == Userzyklusname) oder Dateityp nicht bekannt oder Dateityp gesperrt

# LSV2_ERROR_T_ER_NO_DELETE
source: could not delete file
de: Datei kann nicht gelöscht werden

# LSV2_ERROR_T_ER_NO_NEW_FILE
source: could not create file
de: Datei kann nicht angelegt werden

# LSV2_ERROR_T_ER_NO_CHANGE_ATT
source: file is read only
de: Readonly Attrib. kann nicht verändert werden

# LSV2_ERROR_T_ER_BAD_EMULATEKEY
source: bad key emulation
de: Tastenemulation fehlerhaft

# LSV2_ERROR_T_ER_NO_MP
source: machine parameter wrong or not supported
de: Maschinenparameter nicht vorhanden oder nicht interpretierbar

# LSV2_ERROR_T_ER_NO_WIN
source: wrong window or screen number
de: falsche Window- oder Screennummer

# LSV2_ERROR_T_ER_WIN_NOT_AKTIV
source: window not active
de: Window nicht aktiv

# LSV2_ERROR_T_ER_ANZ
source: error while execution the view task
de: Fehler bei Befehlsabarbeitung in der Anzeigetask

# LSV2_ERROR_T_ER_FONT_NOT_DEFINED
source: font not defined
de: Anfrage eines nicht vorhandenen Fonts

# LSV2_ERROR_T_ER_FILE_ACCESS
source: error during file access
de: Fehler beim Dateizugriff

# LSV2_ERROR_T_ER_WRONG_DNC_STATUS
source: wrong telegram for dnc state
de: Telegramm im aktuellen DNC-Zustand nicht zulässig

# LSV2_ERROR_T_ER_CHANGE_PATH
source: could not change directory
de: Verzeichniswechsel nicht möglich

# LSV2_ERROR_T_ER_NO_RENAME
source: could not rename file
de: Umbenennen nicht möglich

# LSV2_ERROR_T_ER_NO_LOGIN
source: login not possible
de: Login mit angegebenem Privileg nicht möglich (z.B. dieses schon an andere Schnittstelle vergeben)

# LSV2_ERROR_T_ER_BAD_PARAMETER
source: bad parameter in telegram
de: Parameter im Telegram nicht o.k.

# LSV2_ERROR_T_ER_BAD_NUMBER_FORMAT
source: bad number format
de: Falsches Zahlenformat

# LSV2_ERROR_T_ER_BAD_MEMADR
source: bad memory address
de: Falsche Speicheradresse

# LSV2_ERROR_T_ER_NO_FREE_SPACE
source: not enough free space
de: Nicht genug Speicher

# LSV2_ERROR_T_ER_DEL_DIR
source: could not delete directory
de: Verzeichnis kann nicht gelöscht werden

# LSV2_ERROR_T_ER_NO_DIR
source: directory does not exist
de: Verzeichnis nicht vorhanden

# LSV2_ERROR_T_ER_OPERATING_MODE
source: wrong operating mode'
de: Falsche Betriebsart

# LSV2_ERROR_T_ER_NO_NEXT_ERROR
source: no next error available
de: Kein weiterer Fehler erhältlich

# LSV2_ERROR_T_ER_ACCESS_TIMEOUT
source: timeout while waiting for data
de: Wartezeit beim Abholen von Daten abgelaufen

# LSV2_ERROR_T_ER_NO_WRITE_ACCESS
source: no write access
de: kein Schreibzugriff (Preset: gelockte Zeilen)

# LSV2_ERROR_T_ER_STIB
source: could not start DNC mode while machine is active
de: DNC Betrieb kann nicht aufgenommen werden, da Abarbeiten noch aktiv (STIB: Steuerung in Betrieb)

# LSV2_ERROR_T_ER_REF_NECESSARY
source: could not start DNC mode while axes are not referenced
de: Vor DNC Betrieb muß noch Reference gefahren werden

# LSV2_ERROR_T_ER_PLC_BUF_FULL
source: PLC buffer full
de: PLC Puffer ist voll

# LSV2_ERROR_T_ER_NOT_FOUND
source: information not found
de: Angeforderte Information nicht verfügbar (TableLine)

# LSV2_ERROR_T_ER_WRONG_FILE
source: wrong file type or format
de: Falscher Dateityp (Versionsinfo in 1. Zeile defekt)

# LSV2_ERROR_T_ER_NO_MATCH
source: PLC binary code does not macht control
de: Zu ersetzender PLC Binärcode stimmt nicht mit dem Binärcode auf der Steuerung überein (PLC Debug)

# LSV2_ERROR_T_ER_TOO_MANY_TPTS
source: too many trace points
de: Zu viele Trace-Punkte

# LSV2_ERROR_T_ER_NOT_ACTIVATED
source: could not activate file
de: Datei kann nicht aktiviert werden

# LSV2_ERROR_T_ER_DSP_CHANNEL
source: DSP channel not available
de: Angegebener DSP Kanal nicht vorhanden

# LSV2_ERROR_T_ER_DSP_PARA
source: could not read requested DSP data
de: Die gewünschten Daten können nicht gesendet werden

# LSV2_ERROR_T_ER_OUT_OF_RANGE
source: parameter out of range
de: Parameter ausserhalb des gültigen Bereichs

# LSV2_ERROR_T_ER_INVALID_AXIS
source: invalid axis
de: gewählte Achsen ungültig

# LSV2_ERROR_T_ER_STREAMING_ACTIVE
source: axis streaming already active
de: Achs-Streaming bereits aktiv

# LSV2_ERROR_T_ER_NO_STREAMING_ACTIVE
source: no axis streaming active
de: Achs-Streaming nicht aktiv

# LSV2_ERROR_T_ER_TO_MANY_OPEN_TCP
source: to many connections
de: Zu viele TCP Ports auf Steuerung geöffnet

# LSV2_ERROR_T_ER_NO_FREE_HANDLE
source: no free LSV2 handle
de: Kein freies (LSV-2) Handle

# LSV2_ERROR_T_ER_PLCMEMREMA_CLEAR
source: remanten PLC memory was cleared
de: Remanenter PLC Speicher wurde gelöscht

# LSV2_ERROR_T_ER_OSZI_CHSEL
source: channel selection for remote scope incorrect
de: Kanal-Auswahl für Remote-Oszilloskop fehlerhaft

# LSV2_ERROR_LSV2_BUSY
source: transmisson busy
de: Telegrammübertragung noch aktiv (Backgroundtransfer)

# LSV2_ERROR_LSV2_X_BUSY
source: last X_PC telegram was not acknowledged
de: letztes X_PC Telegram noch nicht quittiert

# LSV2_ERROR_LSV2_NOCONNECT
source: no connection
de: Keine Verbindung

# LSV2_ERROR_LSV2_BAD_BACKUP_FILE
source: backup file corrupt
de: Format der Backupdatei fehlerhaft

# LSV2_ERROR_LSV2_RESTORE_NOT_FOUND
source: file not fould in backup
de: Wiederherzustellende Datei in Backup nicht gefunden

# LSV2_ERROR_LSV2_DLL_NOT_INSTALLED
source: ASCII-binary converter dll not installed
de: ASCII-Binär Konverter DLL nicht installiert

# LSV2_ERROR_LSV2_BAD_CONVERT_DLL
source: ACII-binary converter dll not found or corrupt
de: CII-Binär Konverter DLL nicht gefunden oder fehlerhaft

# LSV2_ERROR_LSV2_BAD_BACKUP_LIST
source: backup list file corrupt
de: Backup-Listdatei fehlerhaft

# LSV2_ERROR_LSV2_UNKNOWN_ERROR
source: unknown error
de: Nicht genauer spezifizierter Fehler

# LSV2_ERROR_T_BD_NO_NEW_FILE
source: could not create new file
de: Datei kann nicht geöffnet werden

# LSV2_ERROR_T_BD_NO_FREE_SPACE
source: not enough free memory for file
de: nicht genügend Platz für Datei

# LSV2_ERROR_T_BD_FILE_NOT_ALLOWED
source: file not allowed
de: Programm und Dateiname stimmen nicht überein

# LSV2_ERROR_T_BD_BAD_FORMAT
source: no LF or T_FD sent
de: kein LF oder T_FD gesendet

# LSV2_ERROR_T_BD_BAD_BLOCK
source: error in program block
de: Fehler in Programmzeile (kann nicht binär gewandelt werden)

# LSV2_ERROR_T_BD_END_PGM
source: end of program already reached
de: Programmende bereits erreicht

# LSV2_ERROR_T_BD_ANZ
source: error in execution of display task
de: Fehler bei Befehlsabarbeitung in der Anzeigetask

# LSV2_ERROR_T_BD_WIN_NOT_DEFINED
source: window not defined
de: Window noch gar nicht definiert

# LSV2_ERROR_T_BD_WIN_CHANGED
source: window has changed
de: Window hat sich in Zwischenzeit geändert

# LSV2_ERROR_T_BD_DNC_WAIT
source: DNC-buffer full, file transfer interrupted
de: DNC-Puffer voll; Fileübertragung wird unterbrochen

# LSV2_ERROR_T_BD_CANCELLED
source: transfer canceled by user
de: Übertragung vom Benutzer abgebrochen

# LSV2_ERROR_T_BD_OSZI_OVERRUN
source: buffer overrund, boude rate to low
de: Datenüberlauf (Baudrate zu niedrig)

# LSV2_ERROR_T_BD_FD
source: block transfer finished successfully
de: Blockübertragung beendet (eigentlich kein Fehler)

# LSV2_ERROR_T_USER_ERROR
source: error of type 2 with error message
de: Fehlernummer, wenn ein Fehlertelegramm der Fehlerkasse 2 ( benutzerdefinierter Klarschriftfehler) empfangen wurde

# LSV2_ERROR_UNKNOWN_CODE
source: Unknown Error code
de: Unbekannte Fehlernummer
