Repository: drunsinn/pyLSV2
Catalog: pyLSV2/locales/*/LC_MESSAGES/message_text.po
Languages: de

# PGM_STATE_STARTED
source: Program started
de: Programmlauf gestartet

# PGM_STATE_STOPPED
source: Program stopped
de: Programmlauf gestoppt

# PGM_STATE_FINISHED
source: Program finished
de: Progmlauf beendet

# PGM_STATE_CANCELLED
source: Program cancelled
de: Programlauf abgebrochen

# PGM_STATE_INTERRUPTED
source: Program interrupted by user
de: Programlauf unterbrochen durch Bediener

# PGM_STATE_ERROR
source: Program interrupted with error
de: Programlauf unterbrochen durch Fehler

# PGM_STATE_ERROR_CLEARED
source: Program interrupted with error, error was cleared
de: Programlauf unterbrochen durch Fehler, Fehler wurde quittiert

# PGM_STATE_IDLE
source: No Program running
de: Kein Programm aktiv

# PGM_STATE_UNDEFINED
source: Program state undefined
de: Status unbestimmt

# PGM_STATE_UNKNOWN
source: Unknown Program state
de: Status unbekannt

# EXEC_STATE_MANUAL
source: Manual execution
de: Manuelle Bedienung

# EXEC_STATE_MDI
source: MDI execution
de: MDI

# EXEC_STATE_PASS_REFERENCES
source: Pass References execution
de: Achsen nicht Referenziert

# EXEC_STATE_SINGLE_STEP
source: Single Step execution
de: Programlauf Einzelsatz

# EXEC_STATE_AUTOMATIC
source: Automatic execution
de: Programlauf Automatik

# EXEC_STATE_UNDEFINED
source: Execution state undefined
de: Zustand unbestimmt

# EXEC_STATE_UNKNOWN
source: Unknown Execution state
de: Zustand unbekannt
